backend/mm7/templates/tecloo_submit.soap.tmpl

<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <TransactionID xmlns="http://www.3gpp.org/ftp/Specs/archive/23_series/23.140/schema/REL-6-MM7-1-4" soap-env:mustUnderstand="1">{{.TransactionID}}</TransactionID>
    </soap-env:Header>
    <soap-env:Body>
        <SubmitReq xmlns="http://www.3gpp.org/ftp/Specs/archive/23_series/23.140/schema/REL-6-MM7-1-4">
            <MM7Version>6.8.0</MM7Version>
            <SenderIdentification>
                <VASPID>{{.VASPID}}</VASPID>
                {{- if .VASID}}
                <VASID>{{.VASID}}</VASID>
                {{end}}
                <SenderAddress>
                    <ShortCode>{{.Sender}}</ShortCode>
                </SenderAddress>
            </SenderIdentification>
            <Recipients>
                <To>
                    <Number>{{.Recipient}}</Number>
                </To>
            </Recipients>
            <Subject>{{.Subject}}</Subject>
            <Content allowAdaptations="{{.AllowAdaptations}}" href="cid:{{.ContentID}}" />
        </SubmitReq>
    </soap-env:Body>
</soap-env:Envelope>
